_posts/2024-03-19-mechanicon.html
---
title: History of Mechanicon
description: The history of Europe's biggest event for mechanical computer keyboards
layout: post
image: /assets/mechanicon/mechanicon_header.jpg
permalink: /mechanicon
---

<div id="outline-container-org02a4e63" class="outline-1">
<h1 id="org02a4e63">{{ page.title }}</h1>
<div class="outline-text-1" id="text-org02a4e63">
<p>
{% include image.html url=page.image description=page.description %}
</p>

<p>
This year - 2024 - the Mechanicon happened for the fifth time!
</p>

<p>
Mechanicon is Europe’s biggest meetup/conference for people interested in mechanical keyboards. It takes place once a year in Frankfurt am Main in Germany.
</p>

<p>
We started out with about 60 attendees in 2016, grew over the years and we were over 400 people this year!
</p>

<p>
It was never intended to grow this big. We never did any advertisement outside of community forums. And while we are very proud that so many people like the idea, it also creates a lot of challenges.
</p>
</div>
<div id="outline-container-orgcb15a1a" class="outline-2">
<h2 id="orgcb15a1a">Throwback to 2016</h2>
<div class="outline-text-2" id="text-orgcb15a1a">
<p>
Let's take a trip back to 2016: The whole world was playing Pokemon Go, the most common password was ‘123456’ and '/r/mk' had around 120k subscribers - merely 10% of the size it has today.
</p>

<p>
Three programmers were nerding out on their new hobby: Mechanical keyboards.
</p>

<p>
You all know the rabbit hole we are talking about here: discovering the hobby, the manufactureres, the back and forths of the different parts and also the struggle: what should I get myself?
</p>

<p>
Back then the keyboards we liked had to be bought directly from shops in the U.S., Japan or South Korea. In other words: ordering a keyboard was going all in, including high shipping costs, import taxes and not really a return policy.
</p>

<p>
It was clear what we were missing: a chance to try before you buy.
</p>
</div>
</div>
<div id="outline-container-org1781407" class="outline-2">
<h2 id="org1781407">The first Mechanicon</h2>
<div class="outline-text-2" id="text-org1781407">
<p>
Outside of our office, in real life, we did not know a single person interested in the hobby. So we founded a user group: Mechanical Keyboard Meetup Rhein Main.
</p>

<p>
The first meetup was given the tongue-in-cheek name 'Mechanicon', suggesting it was a conference. In reality, we hoped to attract about a dozen people. In the end, it would be over 60.
</p>

<p>
Only on the day of the Meetup it would become clear to us, that there was something special about this community and this event.
</p>

<p>
People would come from Berlin, huge plastic bags with hundreds of keycaps in the trunk. They would come from France - by bus - with a douzen trackballs in their luggage. Manufacturers, bloggers, collectors, gamers, all came together to celebrate their hobby.
</p>

<p>
This atmosphere, the excitement of everyone, the respect for the community and the love for the craft is what makes the Mechanicon what it is until this day. And it is also what motivates us to organize this event again and again.
</p>

<hr />

<iframe width="100%" height="400" src="https://www.youtube-nocookie.com/embed/ZVF16j6_5t4?si=wkqGwjS9pI8ivms3" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>

<p>
Thanks to Alceon for making the video!
</p>

<hr />
</div>
</div>

<div id="outline-container-org51ae508" class="outline-2">
<h2 id="org51ae508">Links</h2>
<div class="outline-text-2" id="text-org51ae508">
<ul class="org-ul">
<li><a href="https://mechanicon.io/">Mechanicon Official Website</a> with links and pictures from past events</li>
<li><a href="https://mechanicon.io/discord">Mechanicon on Discord</a></li>
<li><a href="https://mastodon.social/@fabrik42">Me on Mastodon</a></li>
<li><a href="https://www.clickclackhack.de/054.html">CLICK! CLACK! HACK Podcast about Mechanicon 2023!</a> (German)</li>
<li><a href="https://www.clickclackhack.de/097.html">CLICK! CLACK! HACK Podcast about Mechanicon 2024!</a> (German)</li>
</ul>
</div>
</div>
</div>
